tap "d12frosted/emacs-plus"
tap "homebrew/cask-fonts"

brew "zsh"
brew "zsh-autosuggestions"
brew "gh"
brew "tree"
brew "zsh-syntax-highlighting"
brew "emacs-plus"
brew "git"
brew "npm"
brew "coreutils"
brew "shellcheck"
brew "bat"
brew "rg"
brew "fd"
brew "cmake"
brew "sqlite3"
brew "libvterm"
brew "gradle"
brew "postgresql"
brew "tmux"
brew "vim"
brew "fasd"
brew "llvm"
brew "R"
brew "koekeishiya/formulae/yabai"
brew "koekeishiya/formulae/skhd"
brew "jq"
brew "rust-analyzer"
brew "ccls"

cask "alacritty"
cask "font-fira-code"
cask "font-fira-sans"
cask "discord"
cask "google-chrome"
cask "intellij-idea"
cask "wireshark"
cask "ubersicht"
cask "adobe-creative-cloud"
