tap "d12frosted/emacs-plus"
tap "homebrew/cask-fonts"

brew "zsh"
brew "zsh-autosuggestions"
brew "gh"
brew "tree"
brew "zsh-syntax-highlighting"
brew "emacs-plus"
brew "git"
brew "npm"
brew "coreutils"
brew "shellcheck"
brew "bat"
brew "rg"
brew "fd"
brew "cmake"
brew "sqlite3"

cask "firefox"
cask "alacritty"
cask "font-fira-code"
cask "font-fira-sans"
cask "rectangle"
cask "oracle-jdk"
